'''
Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.
'''

a = 'Python is awesome!'
for i in range(10):
    print(a)